micropython/micropython/ports/stm32f4/peripherals/stm32f4/stm32f405xx/gpio.c
/*
 * This file is part of the Micro Python project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2019 Lucian Copeland for Adafruit Industries
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "stm32f4xx_hal.h"
#include "stm32f4/gpio.h"
#include "common-hal/microcontroller/Pin.h"

void stm32f4_peripherals_gpio_init(void) {
	//Enable all GPIO for now
	__HAL_RCC_GPIOE_CLK_ENABLE();
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_GPIOF_CLK_ENABLE();
	__HAL_RCC_GPIOH_CLK_ENABLE();
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_GPIOG_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();

	//Status LED chain
	stm32f4_peripherals_status_led(0,1);
	stm32f4_peripherals_status_led(1,0);
	stm32f4_peripherals_status_led(2,0);
	stm32f4_peripherals_status_led(3,0);

	//Never reset pins
	never_reset_pin_number(2,13); //PC13 anti tamp
    never_reset_pin_number(2,14); //PC14 OSC32_IN
    never_reset_pin_number(2,15); //PC15 OSC32_OUT
    never_reset_pin_number(0,13); //PA13 SWDIO
    never_reset_pin_number(0,14); //PA14 SWCLK
    never_reset_pin_number(0,15); //PA15 JTDI
    never_reset_pin_number(1,3); //PB3 JTDO
    never_reset_pin_number(1,4); //PB4 JTRST

    // Port H is not included in GPIO port array
    // never_reset_pin_number(5,0); //PH0 JTDO   
    // never_reset_pin_number(5,1); //PH1 JTRST
}

void stm32f4_peripherals_status_led(uint8_t led, uint8_t state) {

}


